Обработки/Reports/_ДепозитныеВкладыИОблигацииЭмитентаХанты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ДепозитныеВкладыИОблигацииЭмитентаХанты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Эмитенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучателиОповещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСвойства</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючТекущегоВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ДепозитныеВкладыИОблигацииЭмитентаХанты/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Депозитные вклады и ВЭБ Ханты",
		"0.25",
		"",
		Истина);
	
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОповеститьОбОблигацияхИДепозитныхВкладахЗаВчерашнийДень", "Оповестить об облигациях, а также размещениях и вводах депозитных вкладов за вчерашний день",,  Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для запуска загрузки по регламентному заданию
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	// заполним параметры команды (вариативности команд здесь нет)
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
	
	ЭтотОбъект.Организация          = ПараметрыКоманды.Организация;
	ЭтотОбъект.Период               = ТекущаяДата() - 86400;
	ЭтотОбъект.ЮрФизЛицо			= ПараметрыКоманды.ЮрФизЛицо;
	ЭтотОбъект.Эмитент 				= ПараметрыКоманды.Эмитент;
	ЭтотОбъект.ПолучателиОповещения = ПараметрыКоманды.ПолучателиОповещения;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("Источник", ПараметрыОбработки.ДополнительнаяОбработкаСсылка);
	
	СформироватьОтчетОбОблигацияхИДепозитах();
		
КонецПроцедуры // ВыполнитьКоманду

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если КлючТекущегоВарианта = "Основной" Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КлиентыДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|ИЗ
			|	РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
			|ГДЕ
			|	КлиентыДоверительногоУправления.Клиент = &Клиент";
			
		Запрос.УстановитьПараметр("Клиент", 			ЭтотОбъект.ЮрФизЛицо);
		Запрос.УстановитьПараметр("НачалоПериода", 		Новый Граница(НачалоДня(ЭтотОбъект.Период), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ОкончаниеПериода", 	Новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Организация",		ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Эмитент", 			ЭтотОбъект.Эмитент);
		
		СчетаДоверительногоУправления = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СчетДоверительногоУправления");
		
	Иначе
		
		СчетаДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		
	КонецЕсли; 
	
	Параметры = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	ПериодОтчета = ?(ЗначениеЗаполнено(ЭтотОбъект.Период), Новый Граница (КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая), '00010101');
	
	Параметры.УстановитьЗначениеПараметра("Организация",                   ЭтотОбъект.Организация);
	Параметры.УстановитьЗначениеПараметра("Период",                        ПериодОтчета);
	Параметры.УстановитьЗначениеПараметра("Дата",                          НачалоДня(ЭтотОбъект.Период));
	Параметры.УстановитьЗначениеПараметра("СчетаДоверительногоУправления", СчетаДоверительногоУправления);
	Параметры.УстановитьЗначениеПараметра("Эмитент",					   ЭтотОбъект.Эмитент);
	
	// Выполняем программную компоновку
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры // ПриКомпоновкеРезультата

Процедура СформироватьОтчетОбОблигацияхИДепозитах() Экспорт
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,Эмитент,ЮрФизЛицо,ПолучателиОповещения,КлючТекущегоВарианта");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".СформироватьОтчетОбОблигацияхИДепозитах()";
    Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);

	// Проверяем остатки облигаций и приходы по регистру Денежные средства на депозитных вкладах
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
		|ГДЕ
		|	КлиентыДоверительногоУправления.Клиент = &Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваВКредитныхИнструментахОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДенежныеСредстваВКредитныхИнструментахОбороты.СуммаПриход КАК СуммаПриход
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Обороты(
		|			&НачалоПериода,
		|			&ОкончаниеПериода,
		|			,
		|			Организация = Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)
		|				И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления,
		|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|			&ОкончаниеПериода,
		|			Организация = &Организация
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)
		|				И ВЫБОР
		|					КОГДА ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|						ТОГДА ЦеннаяБумага В
		|								(ВЫБРАТЬ
		|									Облигации.Ссылка
		|								ИЗ
		|									Справочник.Облигации КАК Облигации
		|								ГДЕ
		|									Облигации.Эмитент = &Эмитент)
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ) КАК ОстаткиЦенныхБумагОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СУММА(_ИтоговаяТаблица.СуммаПриход) КАК СуммаПриход
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|
		|СГРУППИРОВАТЬ ПО
		|	_ИтоговаяТаблица.СчетДоверительногоУправления";
	
	Запрос.УстановитьПараметр("Клиент", 			ЭтотОбъект.ЮрФизЛицо);
	Запрос.УстановитьПараметр("НачалоПериода", 		Новый Граница(НачалоДня(ЭтотОбъект.Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ОкончаниеПериода", 	Новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",		ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Эмитент", 			ЭтотОбъект.Эмитент);
	
	СчетаДоверительногоУправления = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СчетДоверительногоУправления");
	
	Если СчетаДоверительногоУправления.Количество() > 0 Тогда
		
		Вложения = Новый Соответствие;
		
		Для каждого СчетДУ Из СчетаДоверительногоУправления Цикл
	
			СКДДляОповещений = ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
			
			ПериодОтчета = ?(ЗначениеЗаполнено(ЭтотОбъект.Период), Новый Граница (КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая), '00010101');
			
			СКДДляОповещений.Параметры.Организация.Значение 				  = ЭтотОбъект.Организация;
			СКДДляОповещений.Параметры.Период.Значение 						  = ПериодОтчета;
			СКДДляОповещений.Параметры.СчетаДоверительногоУправления.Значение = СчетДУ;
			СКДДляОповещений.Параметры.Эмитент.Значение 					  = ЭтотОбъект.Эмитент;
			
			Настройки = СКДДляОповещений.ВариантыНастроек.Найти("РассылкаОповещений").Настройки;
			
			КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
			МакетКомпоновки = КомпоновщикМакета.Выполнить(СКДДляОповещений, Настройки);

			ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , , Истина);

			ДокументРезультат = Новый ТабличныйДокумент;
			ПроцессорВывода = Новый	ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
			ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

			КаталогВременныхФайлов = КаталогВременныхФайлов();
			ИмяФайла = "Отчет по " + ЮрФизЛицо + " (депозит+ВЭБ) на " + Формат(ЭтотОбъект.Период, "ДФ=ddMMyy") + " " + ПолучитьПостфиксПоВидуДоговора(СчетДУ);
			ПолноеИмяФайла = КаталогВременныхФайлов + ИмяФайла + ".xls";
			
			ДокументРезультат.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLS97);
			
			Вложения.Вставить(ИмяФайла + ".xls", Новый ДвоичныеДанные(ПолноеИмяФайла));
			
		КонецЦикла;
		
		ПараметрыПисьма = Новый Структура("Кому, Тема, Вложения, ТипТекста",
			ЭтотОбъект.ПолучателиОповещения,
			ИмяФайла,
			Вложения,
			"ПростойТекст");

		РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма);
	
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Функция ПолучитьПостфиксПоВидуДоговора(СчетДУ)
	
	Если СчетДУ.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями Тогда
	
		Возврат "ПН";
		
	ИначеЕсли СчетДУ.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами Тогда
		
		Возврат "ПР";
	
	КонецЕсли; 

КонецФункции

ЭтотОбъект.ДополнительныеСвойства = Новый Структура;
